# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

References: 
    https://stackoverflow.com/questions/15891038/change-column-type-in-pandas

In [2]:
import pandas as pd 
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
temp = pd.read_csv('Temp_States.csv') #Loading to a DataFrame

#### Print `temp`.

In [4]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [9]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [8]:
temp.info

<bound method DataFrame.info of          City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000>

In [5]:
temp.describe()

       Temperature
count     7.000000
mean     15.158730
std       6.695265
min       3.333333
25%      11.944444
50%      17.222222
75%      19.722222
max      22.222222

In [10]:
temp.shape

(7, 3)

In [14]:
temp.isnull().sum()

City           0
State          0
Temperature    0
dtype: int64

 <font color='pink'>
This is a data set containing the temperarures for different cities annd states. The value types are valid, as well as no nulls, so I cann work with this Data Set

#### Select the rows where state is New York.

In [15]:
new_york = temp['State'] == 'New York'
temp[new_york]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [16]:
temp[new_york].groupby(by='State').mean()

          Temperature
State
New York    10.740741

#### Which states and cities have a temperature above 15 degrees Celsius?

In [42]:
temp[temp.Temperature>=15][['City','State']]

       City        State
0       NYC     New York
3  Hartford  Connecticut
5    Treton   New Jersey
6    Newark   New Jersey

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [17]:
temp[temp.Temperature>=15][['City']]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [18]:
temp [(temp['Temperature']>15) & (temp['Temperature']<20)].City #Should I use & or |

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [19]:
temp.groupby(by="State")['Temperature'].agg(['mean','std'])

                  mean       std
State
Connecticut  15.833333  1.964186
New Jersey   21.111111  1.571348
New York     10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [24]:
employees  = pd.read_csv("Employee.csv")
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the `employees` dataframe. Comment your results.

In [25]:
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

In [26]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

In [27]:
"""
your comments here
"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [28]:
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [29]:
# your code here
employees["Salary"].max()

70

#### What's the lowest salary?

In [30]:
# your code here
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [31]:
# your code here
employees[employees['Salary']==employees['Salary'].min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [32]:
employees[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [33]:
employees[employees['Name']=='David'].Salary

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [35]:
employees[employees['Title']=='associate'] 
#and employees['Title']=='Associate']  How to perform two onn the same,

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [36]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [37]:
# Method 2
employees[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [38]:
employees [(employees['Salary']>55)&(employees['Title']=='associate')]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [109]:
employees.groupby(by='Years').mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [110]:
employees.groupby(by='Title').Salary.mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [111]:
q1,q2,q3 = np.quantile(employees['Salary'],[0.25,0.5,0.75])
print(q1,q2,q3)

35.0 55.0 60.0

#### Is the mean salary different per gender?

To answer this question, we need to understand the calculation of gender pay gap, as well as the information from the data set. Calculating the mean difference between average salary would determine if there is a gender pay gap.

In [125]:
# your code here

sal_gen = employees.groupby(by = 'Gender')['Salary'].mean()
sal_gen
gap_ratio = (sal_gen['M']-sal_gen['F'])/(sal_gen['M'])*100
if gap_ratio > 0 
print('There is a pay gap of +',gap_ratio,'% in favor of Men')
#By looking at the salary / gender list I know the mean is higher for mean, therefore; 
#decide to perform the above analysis. However, I would rather create a function.

There is a + 5.0 % in favor of Men

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [126]:
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [128]:
employees.groupby(by='Department').describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [40]:
employees.groupby(by = 'Department')['Salary'].apply() #I need help here

TypeError: apply() missing 1 required positional argument: 'func'

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [121]:
orders = pd.read_csv('Orders.csv')
orders.head(3)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [122]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [102]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    397924 non-null  int64
 1   InvoiceNo     397924 non-null  int64
 2   StockCode     397924 non-null  object
 3   year          397924 non-null  datetime64[ns]
 4   month         397924 non-null  datetime64[ns]
 5   day           397924 non-null  datetime64[ns]
 6   hour          397924 non-null  int64
 7   Description   397924 non-null  object
 8   Quantity      397924 non-null  int64
 9   InvoiceDate   397924 non-null  object
 10  UnitPrice     397924 non-null  float64
 11  CustomerID    397924 non-null  int64
 12  Country       397924 non-null  object
 13  amount_spent  397924 non-null  float64
dtypes: datetime64[ns](3), float64(2), int64(5), object(4)
memory usage: 42.5+ MB

 <font color='pink'>
    From the description anove I notice there are several problems with the Dat Set. 
    The first one: <br>
a) Data Types ( year, month, day, hour are non-time dtypes) <br>
b) Unnamed Column, that is probably some other reference for Invoice Number as thy are similar. <br>
c) Drop Unnamed

In [123]:
#Preproprecessing 
#orders = orders.astype({'year':'datetime64[ns]', 'month':'datetime64[ns]','day':'datetime64[ns]'})
orders.drop('Unnamed: 0', inplace=True, axis=1)

In [105]:
orders.dtypes

InvoiceNo                int64
StockCode               object
year            datetime64[ns]
month           datetime64[ns]
day             datetime64[ns]
hour                     int64
Description             object
Quantity                 int64
InvoiceDate             object
UnitPrice              float64
CustomerID               int64
Country                 object
amount_spent           float64
dtype: object

####  What is the average purchase price?

In [44]:
print ('The average purchase price, or mean is', orders['UnitPrice'].mean())

The average purchase price, or mean is 3.116174480549152

#### What are the highest and lowest purchase prices?

In [45]:
orders['UnitPrice'].max()
orders['UnitPrice'].min()
orders['UnitPrice'].agg(['max','min'])

max    8142.75
min       0.00
Name: UnitPrice, dtype: float64

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [48]:
unique_cust_Spain = orders[orders['Country']=='Spain'].CustomerID.unique()
unique_cust_Spain

array([12557, 17097, 12540, 12551, 12484, 12539, 12510, 12421, 12502,
       12462, 12507, 12541, 12547, 12597, 12545, 12596, 12354, 12417,
       12455, 12450, 12548, 12556, 12550, 12546, 12454, 12448, 12544,
       12538, 12445, 12442])

#### How many customers do we have in Spain?

In [52]:
unique_cust_Spain.shape[0]

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [112]:
fifty_cust = orders.groupby(by='CustomerID').sum()
fifty_cust[fifty_cust['Quantity']>50]

            InvoiceNo   hour  Quantity  UnitPrice  amount_spent
CustomerID
12346          541431     10     74215       1.04      77183.60
12347       101296926   2219      2458     481.21       4310.00
12348        16869685    472      2341     178.71       1797.24
12349        42165457    657       631     605.10       1757.55
12350         9231629    272       197      65.30        334.40
...               ...    ...       ...        ...           ...
18278         5116428     99        66      29.55        173.90
18281         3895248     70        54      39.36         80.82
18282         6838540    146       103      62.39        178.05
18283       425704048  10346      1397    1220.93       2094.88
18287        39474556    697      1586     104.55       1837.28

[4091 rows x 5 columns]

#### Select orders from Spain that include more than 50 items.

In [124]:
fifty_cust_items = orders[(orders['Country']=='Spain') & (orders['Quantity']>50)]
fifty_cust_items.head()

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4251,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0
4252,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.0
4253,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4254,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0

#### Select all free orders.

In [114]:
orders[orders['amount_spent']==0].count()

InvoiceNo       40
StockCode       40
year            40
month           40
day             40
hour            40
Description     40
Quantity        40
InvoiceDate     40
UnitPrice       40
CustomerID      40
Country         40
amount_spent    40
dtype: int64

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
lunch_bag = orders[orders['Description'].str.startswith('lunch bag')]
lunch_bag

#### Select all `lunch bag` orders made in 2011.

In [194]:
lunch_bag[lunch_bag['year']==2011]

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65
...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

In [ ]:
#I decided not to change the date time format. Here I am not calling the date, but the attribute Year.

#### Show the frequency distribution of the amount spent in Spain.

In [201]:
orders_spain = orders[orders['Country']=='Spain']
orders_spain
#orders_spain

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4251,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
4252,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
4253,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4254,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
394733,581193,23291,2011,12,3,17,dolly girl childrens cup,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394734,581193,85232D,2011,12,3,17,set/3 decoupage stacking tins,1,2011-12-07 17:05:00,4.95,17097,Spain,4.95
394735,581193,22721,2011,12,3,17,set of 3 cake tins sketchbook,2,2011-12-07 17:05:00,1.95,17097,Spain,3.90
394736,581193,23241,2011,12,3,17,treasure tin gymkhana design,1,2011-12-07 17:05:00,2.08,17097,Spain,2.08
394737,581193,23247,2011,12,3,17,biscuit tin 50's christmas,1,2011-12-07 17:05:00,2.89,17097,Spain,2.89

#### Select all orders made in the month of August.

In [163]:
orders_august = orders[orders['month']==8]
orders_august

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
199475,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...
226483,565067,22644,2011,8,3,17,ceramic cherry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226484,565067,22645,2011,8,3,17,ceramic heart fairy cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226485,565067,22637,2011,8,3,17,piggy bank retrospot,2,2011-08-31 17:16:00,2.55,15856,United Kingdom,5.10
226486,565067,22646,2011,8,3,17,ceramic strawberry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226487,565067,22741,2011,8,3,17,funky diva pen,48,2011-08-31 17:16:00,0.85,15856,United Kingdom,40.80

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [192]:
orders_august.groupby(['Country']).sum()['Quantity']

Country
Australia           12570
Austria               790
Belgium              2069
Canada                 52
Channel Islands      2009
Denmark               338
EIRE                 9331
Finland               693
France               7958
Germany              9641
Iceland               277
Israel               3028
Italy                1147
Malta                 382
Netherlands         29876
Norway                636
Poland                186
Portugal             1026
Spain                1600
Sweden               1314
Switzerland          2998
United Kingdom     310832
Unspecified           185
Name: Quantity, dtype: int64

#### What's the  average amount of money spent by country?

In [211]:
amount_spent_country = pd.DataFrame(orders.groupby(['Country']).sum()['amount_spent'])
amount_spent_country.head()

           amount_spent
Country
Australia     138521.31
Austria        10198.68
Bahrain          548.40
Belgium        41196.34
Brazil          1143.60

#### What's the most expensive item?

In [229]:
highest_price = orders['UnitPrice'].max()
most_expensive = orders['Description'].loc[orders.isin([highest_price]).any(axis=1)]

print ('The most expenisve item is', most_expensive)

The most expenisve item is 118352    postage
Name: Description, dtype: object

#### What is the average amount spent per year?

In [230]:
orders['amount_spent'].mean()

22.39474850474768